// Методи string

let str1 = "Hello Mr.Bodnar";
str1.indexOf("o"); // повертає індекс такого значення як в дужках
console.log(str1);

str1.lastIndexOf("Mr."); // показує індекс значення беручи ост.символ

str1.charAt(7);

let replace = str1.replace("o", "a"); // замінює символ на інший,
// але тільки першмй

//RegExp(/o/g) - замінить ВСІ літери О, тут g - це глобально, на всій стрічці
//RegExp(/o/g) - замінить ВСІ літери О, тут i - це іггнорує регістр, тому перевірить всі великі й малі

//str1.slice(10, 15) - обріже із 10го символу до 15 не включаючи для якоїсь змінної str1
//str1.slice(10) - обріже із 10го символу до кінця
//str1.slice(-3) - обріже із 3го символу з кінця

str1.split("o"); // рядок розрізає на  масиви порізавши їх в місці де ця буква

let names = ["Vova, Vira", "Nastja"];
let s = names.join("..."); // якийсь масив обєднається в один стрінг цим сепаратором

// toLowerCase
// toUpperCase - стрічка до нижнього
// trim - обрізає всі пробіли зліва і справа
// names.includes("test") - чи є даний текст чи символ в string чи в масиві names

// Функції
